Organize/task-5_3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-24 Fri 15:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OSQ+100 Task 5.3 "Software Stack" &#x2013; Project Management</title>
<meta name="author" content="Dirk Oliver Theis, University of Tartu, Estonia" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OSQ+100 Task 5.3 "Software Stack" &#x2013; Project Management</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6ec8cce">1. Task Description</a></li>
<li><a href="#org889af53">2. Task Outline: Milestones, Deliverables, etc</a>
<ul>
<li><a href="#org8547b55">2.1. Components</a></li>
<li><a href="#orgb3fb41f">2.2. Relies on</a></li>
<li><a href="#orgce930fe">2.3. Output</a></li>
<li><a href="#org97601df">2.4. Contributing partners</a></li>
</ul>
</li>
<li><a href="#org1110a9e">3. Task-Leader Reports</a>
<ul>
<li><a href="#orgc742509">3.1. TLR Nov 2023: Task 5.3 <i>Software Stack</i></a>
<ul>
<li><a href="#org922d327">3.1.1. Deviations from Annex I., the consequences and the proposed corrective actions</a></li>
<li><a href="#orgab71ff4">3.1.2. Activities / critical objectives or deliverables</a></li>
<li><a href="#org613dbd5">3.1.3. Implementation risks and mitigation actions</a></li>
<li><a href="#org10b691f">3.1.4. Unforeseen Risks</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1dae9e3">4. End Of File</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6ec8cce" class="outline-2">
<h2 id="org6ec8cce"><span class="section-number-2">1.</span> Task Description</h2>
<div class="outline-text-2" id="text-1">
<p>
From the Grant Agreement
</p>

<blockquote>
<p>
<span class="underline">Task 5.3: Software stack</span>
</p>

<p>
(Partners involved: UTartu*, Wigner RCP, Qruise, TNO, FZJ; Duration: M1-M42)
</p>

<p>
Once the QC is fully calibrated, we require an optimizing compiler to best match users’ circuits to each
hardware’s specific capabilities.  In addition, a Quantum OS is required, allowing lab members and trusted
collaborators to submit circuits for execution (a.k.a. private cloud), and including everything needed for
ongoing operations: a scheduler, recalibration and status monitoring.
</p>

<p>
Creation of an <b>optimizing compiler</b> will be led by UTartu and be comprised of two steps.  In <b>Phase 1</b>
(deliverable D5.3) WP5 shall implement an optimizing compiler which would allow arbitrary quantum circuits to
be executed on OpenSuperQPlus100 hardware.  Optimized mapping of circuit layout and gate-set.  In <b>Phase 2</b>,
the Phase 1 compiler shall be extended to include <i>dynamic adaptation to newly calibrated gates and gate
error rates</i> as well as support for <i>integration of classical logic</i> in the quantum circuit for error
correction implementation.
</p>

<p>
To allow efficient work by the various project partners, we must allow for shared usage of the QCs.  In other
words – we must provide for private <b>cloud access</b>.  This will comprise of a means of sending circuits to be
evaluated, a circuit <b>queue</b>, and a mechanism to return results (milestone MS17).  Further, to allow certain
maintenance operations of the QCs and to prevent interactive algorithms from going back to the end of the
queue in each iteration, priorities shall be built into the queuing mechanism.
</p>

<p>
It is imperative that QPUs keep operating at the lowest error rates.  For that purpose, <b>recalibration</b> shall
be implemented, with the goal of minimizing QC downtime and maximizing fidelities throughout.  Finally, basic
<b>monitoring</b> capabilities will be provided (deliverable D5.7), to allow QC operators to view system health
and performance.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org889af53" class="outline-2">
<h2 id="org889af53"><span class="section-number-2">2.</span> Task Outline: Milestones, Deliverables, etc</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8547b55" class="outline-3">
<h3 id="org8547b55"><span class="section-number-3">2.1.</span> Components</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Optimizing Compiler (UTartu)
<ul class="org-ul">
<li>Phase 1</li>
<li>Phase 2</li>
</ul></li>

<li>Quantum OS (Qruise)
<ul class="org-ul">
<li>Cloud access
<ul class="org-ul">
<li>Scheduler</li>
</ul></li>
<li>Recalibration</li>
<li>Monitoring</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb3fb41f" class="outline-3">
<h3 id="orgb3fb41f"><span class="section-number-3">2.2.</span> Relies on</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Respo.</th>
<th scope="col" class="org-right">Start</th>
<th scope="col" class="org-right">Dead</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M7</td>
<td class="org-left">User reqs, system specs &amp; breakdown based on plans, interface defs agreed</td>
<td class="org-left">Orange</td>
<td class="org-right">24-01</td>
<td class="org-right">24-02</td>
</tr>

<tr>
<td class="org-left">M9</td>
<td class="org-left">Interface [from WP4] to WP5 operational</td>
<td class="org-left">Orange</td>
<td class="org-right">24-04</td>
<td class="org-right">24-05</td>
</tr>

<tr>
<td class="org-left">M3</td>
<td class="org-left">Low-level interface phase 1 definition</td>
<td class="org-left">Qruise</td>
<td class="org-right">23-07</td>
<td class="org-right">23-08</td>
</tr>

<tr>
<td class="org-left">M17</td>
<td class="org-left">Low-level interface phase 2 definition</td>
<td class="org-left">Qruise</td>
<td class="org-right">25-01</td>
<td class="org-right">25-02</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgce930fe" class="outline-3">
<h3 id="orgce930fe"><span class="section-number-3">2.3.</span> Output</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-right">Start</th>
<th scope="col" class="org-right">Dead</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">D5.3</td>
<td class="org-left">Optimizing Compiler v1</td>
<td class="org-right">2025-01-01</td>
<td class="org-right">2025-02-28</td>
</tr>

<tr>
<td class="org-left">D5.7</td>
<td class="org-left">Quantum OS — Monitoring and recalibration</td>
<td class="org-right">2026-07-01</td>
<td class="org-right">2026-08-31</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org97601df" class="outline-3">
<h3 id="org97601df"><span class="section-number-3">2.4.</span> Contributing partners</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Partner</th>
<th scope="col" class="org-right">Total PMs</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">in WP5</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="underline">UTartu</span></td>
<td class="org-right">2.0</td>
</tr>

<tr>
<td class="org-left">Qruise</td>
<td class="org-right">40.5</td>
</tr>

<tr>
<td class="org-left">FZJ</td>
<td class="org-right">26.0</td>
</tr>

<tr>
<td class="org-left">TNO</td>
<td class="org-right">21.3</td>
</tr>

<tr>
<td class="org-left">Wigner RCP</td>
<td class="org-right">10.0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org1110a9e" class="outline-2">
<h2 id="org1110a9e"><span class="section-number-2">3.</span> Task-Leader Reports</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc742509" class="outline-3">
<h3 id="orgc742509"><span class="section-number-3">3.1.</span> TLR Nov 2023: Task 5.3 <i>Software Stack</i></h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Task leader:
<ul class="org-ul">
<li>UTartu</li>
</ul></li>
<li>Other project partners participating in the task:
<ul class="org-ul">
<li>Wigner RCP</li>
<li>Qruise</li>
<li>TNO</li>
<li>FZJ</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org922d327" class="outline-4">
<h4 id="org922d327"><span class="section-number-4">3.1.1.</span> Deviations from Annex I., the consequences and the proposed corrective actions</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-orgab71ff4" class="outline-4">
<h4 id="orgab71ff4"><span class="section-number-4">3.1.2.</span> Activities / critical objectives or deliverables</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
On the management level, the management of the components of Task 5.3 has been split.  Qruise will organize
the work on the Quantum OS, which comprises: cloud access (incl. scheduler); recalibration; monitorying.
UTartu will organize the work on the optimizing compiler, phase 1 and phase 2.
</p>

<p>
On the development level, Wigner RCP contributes improved gate factorization to the optimizing compiler; they
have reached TRL 4 with that work.  UTartu will integrate the components of the compiler based on, as much as
possible, freely available open-source components; they have started to work on that: One of the senior
researchers has 5% workload on it as of Oct 1.  Development work on the compiler is waiting for the <i>Low-level
interface phase 1 definition</i> (M3).
</p>

<p>
The next deliverable is D5.3 <i>Optimizing Compiler v1</i> in Jan-Feb, 2025.
</p>
</div>
</div>


<div id="outline-container-org613dbd5" class="outline-4">
<h4 id="org613dbd5"><span class="section-number-4">3.1.3.</span> Implementation risks and mitigation actions</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
N/A
</p>

<p>
(Risk № 5 "No hardware available for testing of software stack" does not apply as there's nothing to be tested
yet.)
</p>
</div>
</div>

<div id="outline-container-org10b691f" class="outline-4">
<h4 id="org10b691f"><span class="section-number-4">3.1.4.</span> Unforeseen Risks</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
No unforeseen risks are foreseen.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1dae9e3" class="outline-2">
<h2 id="org1dae9e3"><span class="section-number-2">4.</span> End Of File</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Nov 24 15:55:20 EET 2023</p>
<p class="author">Author: Dirk Oliver Theis, University of Tartu, Estonia</p>
<p class="date">Created: 2023-11-24 Fri 15:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>